Docs: updated readme with updted information
